jmeter/500 user 3 thread/statistics.json
{
  "create message" : {
    "transaction" : "create message",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 689.0,
    "medianResTime" : 689.0,
    "minResTime" : 689.0,
    "maxResTime" : 689.0,
    "pct1ResTime" : 689.0,
    "pct2ResTime" : 689.0,
    "pct3ResTime" : 689.0,
    "throughput" : 1.4513788098693758,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  },
  "Produce Kafka message for user" : {
    "transaction" : "Produce Kafka message for user",
    "sampleCount" : 5000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 14966.878599999982,
    "medianResTime" : 13795.0,
    "minResTime" : 1594.0,
    "maxResTime" : 34508.0,
    "pct1ResTime" : 24410.700000001714,
    "pct2ResTime" : 29789.85,
    "pct3ResTime" : 32901.94,
    "throughput" : 32.52370978443285,
    "receivedKBytesPerSec" : 0.5368571892034293,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 5303,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 15288.003017160116,
    "medianResTime" : 13868.0,
    "minResTime" : 689.0,
    "maxResTime" : 58889.0,
    "pct1ResTime" : 26067.80000000001,
    "pct2ResTime" : 29931.800000000003,
    "pct3ResTime" : 32944.92,
    "throughput" : 22.749795153173945,
    "receivedKBytesPerSec" : 0.3540662765282002,
    "sentKBytesPerSec" : 0.0
  },
  "Create + subscribe consumers" : {
    "transaction" : "Create + subscribe consumers",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 58889.0,
    "medianResTime" : 58889.0,
    "minResTime" : 58889.0,
    "maxResTime" : 58889.0,
    "pct1ResTime" : 58889.0,
    "pct2ResTime" : 58889.0,
    "pct3ResTime" : 58889.0,
    "throughput" : 0.01698110003566031,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  },
  "Consume Kafka message for user - receive latency" : {
    "transaction" : "Consume Kafka message for user - receive latency",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 20527.989999999994,
    "medianResTime" : 20442.5,
    "minResTime" : 8299.0,
    "maxResTime" : 37538.0,
    "pct1ResTime" : 29277.30000000001,
    "pct2ResTime" : 31521.25,
    "pct3ResTime" : 35502.08,
    "throughput" : 7.911601044331338,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  },
  "Close consumers" : {
    "transaction" : "Close consumers",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 19912.0,
    "medianResTime" : 19912.0,
    "minResTime" : 19912.0,
    "maxResTime" : 19912.0,
    "pct1ResTime" : 19912.0,
    "pct2ResTime" : 19912.0,
    "pct3ResTime" : 19912.0,
    "throughput" : 0.0502209722780233,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  }
}