jmeter/700 user 300 consumer 0.5 cpu 2gb ram/statistics.json
{
  "create message" : {
    "transaction" : "create message",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 419.0,
    "medianResTime" : 419.0,
    "minResTime" : 419.0,
    "maxResTime" : 419.0,
    "pct1ResTime" : 419.0,
    "pct2ResTime" : 419.0,
    "pct3ResTime" : 419.0,
    "throughput" : 2.3866348448687353,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  },
  "Produce Kafka message for user" : {
    "transaction" : "Produce Kafka message for user",
    "sampleCount" : 7000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 17369.223714285687,
    "medianResTime" : 18335.0,
    "minResTime" : 70.0,
    "maxResTime" : 47053.0,
    "pct1ResTime" : 23127.0,
    "pct2ResTime" : 24250.0,
    "pct3ResTime" : 27873.0,
    "throughput" : 38.325923654760075,
    "receivedKBytesPerSec" : 0.6446540127242066,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 7303,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 17479.88689579621,
    "medianResTime" : 18478.0,
    "minResTime" : 70.0,
    "maxResTime" : 77389.0,
    "pct1ResTime" : 23479.6,
    "pct2ResTime" : 24338.6,
    "pct3ResTime" : 27876.92,
    "throughput" : 27.617895095110235,
    "receivedKBytesPerSec" : 0.4452678875316719,
    "sentKBytesPerSec" : 0.0
  },
  "Create + subscribe consumers" : {
    "transaction" : "Create + subscribe consumers",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 77389.0,
    "medianResTime" : 77389.0,
    "minResTime" : 77389.0,
    "maxResTime" : 77389.0,
    "pct1ResTime" : 77389.0,
    "pct2ResTime" : 77389.0,
    "pct3ResTime" : 77389.0,
    "throughput" : 0.012921733062838388,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  },
  "Consume Kafka message for user - receive latency" : {
    "transaction" : "Consume Kafka message for user - receive latency",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 19963.896666666657,
    "medianResTime" : 21082.5,
    "minResTime" : 6922.0,
    "maxResTime" : 34807.0,
    "pct1ResTime" : 25014.100000000002,
    "pct2ResTime" : 25121.65,
    "pct3ResTime" : 33257.88000000001,
    "throughput" : 8.61648045495017,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  },
  "Close consumers" : {
    "transaction" : "Close consumers",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4071.0,
    "medianResTime" : 4071.0,
    "minResTime" : 4071.0,
    "maxResTime" : 4071.0,
    "pct1ResTime" : 4071.0,
    "pct2ResTime" : 4071.0,
    "pct3ResTime" : 4071.0,
    "throughput" : 0.24563989191844754,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  }
}