jmeter/700user 300 consumer 100% cpu 2gb ram/statistics.json
{
  "create message" : {
    "transaction" : "create message",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 467.0,
    "medianResTime" : 467.0,
    "minResTime" : 467.0,
    "maxResTime" : 467.0,
    "pct1ResTime" : 467.0,
    "pct2ResTime" : 467.0,
    "pct3ResTime" : 467.0,
    "throughput" : 2.1413276231263385,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  },
  "Produce Kafka message for user" : {
    "transaction" : "Produce Kafka message for user",
    "sampleCount" : 6842,
    "errorCount" : 2,
    "errorPct" : 0.029231219,
    "meanResTime" : 16648.00891552179,
    "medianResTime" : 14758.0,
    "minResTime" : 2870.0,
    "maxResTime" : 54951.0,
    "pct1ResTime" : 29493.4,
    "pct2ResTime" : 31297.85,
    "pct3ResTime" : 36714.689999999966,
    "throughput" : 40.14834113767325,
    "receivedKBytesPerSec" : 0.6746394343613937,
    "sentKBytesPerSec" : 0.0
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 7145,
    "errorCount" : 2,
    "errorPct" : 0.027991602,
    "meanResTime" : 16714.305808257515,
    "medianResTime" : 14860.0,
    "minResTime" : 467.0,
    "maxResTime" : 77461.0,
    "pct1ResTime" : 29405.600000000002,
    "pct2ResTime" : 31256.7,
    "pct3ResTime" : 36575.159999999996,
    "throughput" : 28.213116631326233,
    "receivedKBytesPerSec" : 0.45397926612333217,
    "sentKBytesPerSec" : 0.0
  },
  "Create + subscribe consumers" : {
    "transaction" : "Create + subscribe consumers",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 77461.0,
    "medianResTime" : 77461.0,
    "minResTime" : 77461.0,
    "maxResTime" : 77461.0,
    "pct1ResTime" : 77461.0,
    "pct2ResTime" : 77461.0,
    "pct3ResTime" : 77461.0,
    "throughput" : 0.012909722311873073,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  },
  "Consume Kafka message for user - receive latency" : {
    "transaction" : "Consume Kafka message for user - receive latency",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 18117.190000000013,
    "medianResTime" : 19623.0,
    "minResTime" : 10602.0,
    "maxResTime" : 24300.0,
    "pct1ResTime" : 23238.8,
    "pct2ResTime" : 23596.8,
    "pct3ResTime" : 24105.54,
    "throughput" : 11.899095668729176,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  },
  "Close consumers" : {
    "transaction" : "Close consumers",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 4953.0,
    "medianResTime" : 4953.0,
    "minResTime" : 4953.0,
    "maxResTime" : 4953.0,
    "pct1ResTime" : 4953.0,
    "pct2ResTime" : 4953.0,
    "pct3ResTime" : 4953.0,
    "throughput" : 0.20189783969311528,
    "receivedKBytesPerSec" : 0.0,
    "sentKBytesPerSec" : 0.0
  }
}